{
  "architectures": [
    "MiniMindForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "decoder_sparse_step": 1,
  "dtype": "bfloat16",
  "use_moe": true,
  "head_dim": 96,
  "hidden_act": "silu",
  "hidden_size": 1024,
  "initializer_range": 0.02,
  "intermediate_size": 2048,
  "max_position_embeddings": 32768,
  "mlp_only_layers": [0,1,2],
  "model_type": "minimind",
  "moe_intermediate_size": 2048,
  "norm_topk_prob": true,
  "num_attention_heads": 8,
  "num_experts": 8,
  "num_experts_per_tok": 2,
  "num_hidden_layers": 16,
  "num_key_value_heads": 4,
  "output_router_logits": false,
  "rms_norm_eps": 1e-06,
  "rope_scaling": null,
  "rope_theta": 1000000.0,
  "router_aux_loss_coef": 0.001,
  "sliding_window": null,
  "tie_word_embeddings": true,
  "transformers_version": "4.57.6",
  "use_cache": true,
  "use_sliding_window": false,
  "vocab_size": 6400
}
